gaotongfont/GT-MindCraft-Embedded/chatbot/ESP32 IDF Project/main/main.c
//                     audio_free(receive_evt->emotion_value);
//                     receive_evt->emotion_value = NULL;

//                     audio_free(receive_evt->llm_response);
//                     receive_evt->llm_response = NULL;
//                 } else {
//                     audio_free(receive_evt);
//                     receive_evt = NULL;
//                 }
//             }
//         }
//         vTaskDelay(500);  // 延迟100ms，避免过度占用CPU
//     }
// }

#elif (WEBSOCKET_HTTP_SWITCH == 2)
void gt_streamAudio_task()
{
    int audio_status = -1;
    bool isFinishing = false, startListen = false;
    ReceivedAnswerData* receive_evt = NULL;
    audio_event_iface_msg_t* msg = NULL;
    msg = get_iface_msg(gt_pipeline_single());
    gt_pipeline_st* gt_pipeline_obj = gt_pipeline_single();
    while(1)
    {
        if(get_startListen() == true)
        {
            audio_event_iface_listen(get_evt(gt_pipeline_obj), msg, pdMS_TO_TICKS(400));
            ESP_LOGI(TAG, "msg->data_1  =====  %d", (int)msg->data);
        }
        // ESP_LOGI(TAG, "msg->data_2  =====  %d", (int)msg->data);
        if(get_startListen() == true && msg->source == (void *) get_i2s_stream_writer(gt_pipeline_single()) && (int)msg->data == AEL_STATUS_STATE_FINISHED
            && msg->cmd == AEL_MSG_CMD_REPORT_STATUS && msg->source_type == AUDIO_ELEMENT_TYPE_ELEMENT)
        {
            gt_audio_pipeline_stop(gt_pipeline_single());
            ESP_LOGI(TAG, "gt_audio_pipeline_stop");
            set_startListen(gt_pipeline_obj, false);
        }
        // ESP_LOGI(TAG, "msg->data_3  =====  %d", (int)msg->data);
        if((get_startListen() == false && (int)msg->data != AEL_STATUS_STATE_RUNNING) || get_startListen() == false || (int)msg->data != AEL_STATUS_STATE_RUNNING)
        {
            ESP_LOGE(TAG, "xSemaphoreTake!!!!!!!!!!!!\r\n");
            xSemaphoreTake(tts_audio_sem, portMAX_DELAY);
            gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
            ESP_LOGI(TAG,">>---------------screen_id: %d\n",screen_id);
            char* chatbot_audio_uri = get_chatbot_audio_uri();
            if(chatbot_audio_uri != NULL)
            {
                int res = gt_audio_pipeline_run(gt_pipeline_single(), chatbot_audio_uri);
                startListen = true;
                set_startListen(gt_pipeline_single(), true);
            }
            free_chatbot_audio_uri();
        }
        vTaskDelay(500);  // 延迟100ms，避免过度占用CPU
    }
}

void gt_streamAudio_task_v()
{
    int audio_status = -1, status = 0;
    bool isFinishing = false, startListen = false;
    ReceivedAnswerData* receive_evt = NULL;
    char* audio_uri = NULL;
    
    gt_pipeline_st* gt_pipeline_obj = gt_pipeline_single();
    set_startListen(gt_pipeline_obj, false);
    while(1)
    {
        xQueueReceive(web_audio_queue, &audio_uri, portMAX_DELAY);
        int res = gt_audio_pipeline_run(gt_pipeline_obj, audio_uri);
        // free_chatbot_audio_uri();
        while(1)
        {
            ESP_LOGI(TAG, "audio_event_iface_listen");
            audio_event_iface_msg_t msg;
            esp_err_t ret = audio_event_iface_listen(get_evt(gt_pipeline_obj), &msg, pdMS_TO_TICKS(300)/*portMAX_DELAY*/);
            if (ret != ESP_OK)  
            {
                ESP_LOGE(TAG, "[ * ] Event interface error : %d", ret);
                continue;
            }

            /* Stop when the last pipeline element (i2s_stream_writer in this case) receives stop event */
            if (msg.source_type == AUDIO_ELEMENT_TYPE_ELEMENT && msg.source == (void *)get_i2s_stream_writer(gt_pipeline_single())
                && msg.cmd == AEL_MSG_CMD_REPORT_STATUS
                && ((int)msg.data == AEL_STATUS_STATE_FINISHED)) {
                ESP_LOGW(TAG, "[ * ] Finish event received");
                
                xSemaphoreTake(audio_event_mutex, portMAX_DELAY);
                xQueueSend(audio_event_queue, &status, portMAX_DELAY);
                xSemaphoreGive(audio_event_mutex);
                break;
            }
            else if(msg.source_type == AUDIO_ELEMENT_TYPE_ELEMENT && msg.source == (void *)get_i2s_stream_writer(gt_pipeline_single())
            && msg.cmd == AEL_MSG_CMD_REPORT_STATUS
            && ((int)msg.data == AEL_STATUS_STATE_STOPPED))
            {
                ESP_LOGW(TAG, "[ * ] Stop event received");
                break;
            }
        }        
        ESP_LOGW(TAG, "gt_streamAudio_task_v audio stop or finish");
        free_chatbot_audio_uri();
        vTaskDelay(500);  // 延迟100ms，避免过度占用CPU
    }
}
#endif

#if MONITOR_WIFI_SIGNAL
void get_wifi_signal_anytime()
{
    int level = 0;
    gt_obj_st * dialog = NULL;
    while(1)
    {
        level = get_current_rssi_level();
        printf("wifi_scan_anytime level   ======== %d\r\n",level);
        if (level != WIFI_SIGNAL_4 && dialog == NULL) {
            dialog = _Unstable_network_dialog1_init();
            ESP_LOGI(TAG,"11-------------------dialog----------------%p\r\n",dialog);
        }
        if(level == WIFI_SIGNAL_4 && dialog != NULL) {
            ESP_LOGI(TAG,"11-------------------dialog----------------%p\r\n",dialog);
            gt_dialog_close(dialog);
            dialog = NULL;
        }
        gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
        if (screen_id == GT_ID_MAIN_INTERFACE)
        {
            set_wifi_status_icon(level);
        }
        vTaskDelay(5000/portTICK_PERIOD_MS);
    }
}
#endif
void cb_data_init();
void app_main(void)
{
    esp_xl9555_config_t pca_cfg = {0};
    key_mutex = xSemaphoreCreateMutex();
    audio_event_mutex = xSemaphoreCreateMutex();
    audio_event_queue = xQueueCreate(6, sizeof(int));
    web_audio_queue = xQueueCreate(6, sizeof(char*));
    web_room_id_queue = xQueueCreate(3, sizeof(char*));

    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES) {
        // NVS partition was truncated and needs to be erased
        // Retry nvs_flash_init
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 1, 0))
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
#else
    tcpip_adapter_init();
#endif
    // init audio board
    gt_board_handle = audio_board_init();
    audio_hal_ctrl_codec(gt_board_handle->audio_hal, AUDIO_HAL_CODEC_MODE_BOTH, AUDIO_HAL_CTRL_START);
    audio_hal_set_volume(gt_board_handle->adc_hal, 100);
    // peripheral init
    esp_periph_config_t set_periph_cfg = DEFAULT_ESP_PERIPH_SET_CONFIG();
    set_periph_cfg.extern_stack = true;
    set = esp_periph_set_init(&set_periph_cfg);

